
var title = "哲学时间线";

// 哲学家与医学家
// 公元前的年份采用 ISO 8601 天文纪年法，其中 0 年即公元前 1 年，
// 因此 "-0469" 表示公元前 470 年，与标题中的公元前年份相差一年。
var tl_philosopher = {
    "dateTimeFormat": "iso8601",
    "events": [
        {
            "start": "-0469",
            "title": "苏格拉底（前470/469-前399）",
            "description": "Sokrates"
        },
        {
            "start": "-0460",
            "title": "希波克拉底（前460-前370）",
            "description": "希波克拉底被认为是医学史上最杰出的人物之一，被誉为“医学之父”。为纪念他对医学的深远贡献，最著名的医学文献《希波克拉底誓言》以他的名字命名。"
        },
        {
            "start": "-0426",
            "title": "柏拉图（前427-前347）",
            "description": "Platon"
        },
        {
            "start": "-0383",
            "title": "亚里士多德（前384-前322）",
            "description": "Aristoteles"
        },
        {
            "start": "-0105",
            "title": "西塞罗（前106-前43）",
            "description": "马库斯·图利乌斯·西塞罗"
        },
        {
            "start": "0129",
            "title": "盖伦（129-200/216）",
            "description": "克劳狄乌斯·盖伦，古罗马著名的医学家和哲学家。他的理论影响并主导了欧洲医学一千多年。"
        },
        {
            "start": "1285",
            "title": "奥卡姆的威廉（1285?-1347/49）",
            "description": "威廉·奥卡姆“如无必要，勿增实体。”这句话被称为“奥卡姆剃刀”。"
        },
        {
            "start": "1469",
            "title": "马基雅维利（1469-1527）",
            "description": "尼科洛·马基雅维利，意大利文艺复兴时期的重要人物，被称为近代政治学之父。其著作《君主论》阐述了现实主义政治理论。"
        },
        {
            "start": "1588",
            "title": "霍布斯（1588-1679）",
            "description": "托马斯·霍布斯"
        },
        {
            "start": "1632",
            "title": "洛克（1632-1704）",
            "description": "约翰·洛克"
        },
        {
            "start": "1724",
            "title": "康德（1724-1804）",
            "description": "伊曼努尔·康德"
        },
        {
            "start": "1818",
            "title": "马克思（1818-1883）",
            "description": "卡尔·海因里希·马克思"
        },
        {
            "start": "1872",
            "title": "罗素（1872-1970）",
            "description": "伯特兰·罗素，科学家，诺贝尔文学奖得主"
        },
        {
            "start": "1889",
            "title": "维特根斯坦（1889-1951）",
            "description": "路德维希·约瑟夫·约翰·维特根斯坦，奥地利哲学家，20世纪最有影响力的哲学家之一，主要研究语言哲学与心灵哲学。"
        },
        {
            "start": "1921",
            "title": "约翰·罗尔斯（1921-2002）",
            "description": "约翰·罗尔斯，20世纪70年代西方新自然法学派的代表人物，以公平与正义的研究著称。"
        },
        {
            "start": "1942",
            "title": "霍金（1942-2018）",
            "description": "史蒂芬·霍金"
        }
    ]
};

// 文艺复兴
var tl_renaissance = {
    "dateTimeFormat": "iso8601",
    "events": [
        {
            "start": "1350",
            "end": "1650",
            "title": "文艺复兴时期（14—17世纪）",
            "description": "文艺复兴",
            "isDuration": true,
            "textColor": "black",
            "color": "#31B404"
        },
        {
            "start": "1440",
            "title": "古腾堡发明活字印刷术",
            "description": "约翰内斯·古腾堡"
        },
        {
            "start": "1475",
            "title": "米开朗基罗（1475-1564）",
            "description": "米开朗基罗，文艺复兴时期杰出的全才"
        },
        {
            "start": "1452",
            "title": "列奥纳多·达·芬奇（1452-1519）",
            "description": "列奥纳多·达·芬奇"
        },
        {
            "start": "1483",
            "title": "拉斐尔（1483-1520）",
            "description": "意大利画家拉斐尔·圣齐奥"
        },
        {
            "start": "1543",
            "title": "哥白尼《天体运行论》出版",
            "description": ""
        },
        {
            "start": "1492-10-12",
            "title": "哥伦布发现新大陆",
            "description": ""
        },
        {
            "start": "1521",
            "title": "麦哲伦船队完成环球航行",
            "description": "葡萄牙人斐迪南·麦哲伦"
        },
        {
            "start": "1473",
            "title": "哥白尼（1473-1543）",
            "description": "尼古拉·哥白尼"
        },
        {
            "start": "1564",
            "title": "伽利略（1564-1642）",
            "description": "伽利略·伽利莱"
        },
        {
            "start": "1514",
            "title": "维萨里（1514-1564）",
            "description": "安德烈·维萨里，比利时人，文艺复兴时期的解剖学家、医生。其著作《人体的构造》被认为是人体解剖学的权威著作之一，维萨里被视为近代人体解剖学的创始人。"
        },
        {
            "start": "1564",
            "title": "莎士比亚（1564-1616）",
            "description": "威廉·莎士比亚"
        }
    ]
};

// 科学革命
var tl_scientific_revolution = {
    "dateTimeFormat": "iso8601",
    "events": [
        {
            "start": "1620",
            "end": "2020",
            "title": "科学革命（1620-2020）",
            "description": "",
            "isDuration": true,
            "textColor": "black",
            "color": "#2E9AFE"
        },
        {
            "start": "1546",
            "title": "第谷·布拉赫（1546-1601）",
            "description": "丹麦贵族、天文学家，开普勒曾是他的助手。"
        },
        {
            "start": "1571",
            "title": "开普勒（1571-1630）",
            "description": "德国天文学家、数学家。开普勒是17世纪科学革命的关键人物，最著名的成就是开普勒定律，出自其著作《新天文学》《世界的和谐》和《哥白尼天文学概要》。这些巨著深刻影响了艾萨克·牛顿，启发牛顿提出万有引力定律。"
        },
        {
            "start": "1628",
            "title": "哈维《心血运动论》",
            "description": "这本书从根本上推翻了主导千年之久的古典心血运动观念，提出血液是循环流动的，心脏有节律的持续搏动是血液在全身循环的动力。"
        },
        {
            "start": "1642",
            "title": "牛顿（1642-1726）",
            "description": "艾萨克·牛顿"
        },
        {
            "start": "1687",
            "title": "牛顿《自然哲学的数学原理》",
            "description": "在这篇1687年发表的论文中，他描述了万有引力定律和三大运动定律。这些描述奠定了此后三个世纪的物理世界科学观，并成为现代工程学的基础。他证明地面物体与天体的运动都遵循相同的自然定律，为日心说提供了强有力的理论支持，推动了科学革命。在力学上，牛顿阐明了动量与角动量守恒原理，提出了牛顿运动定律。在光学上，他发明了反射望远镜，并基于对棱镜将白光分解为可见光谱的观察发展出颜色理论。他还系统地表述了冷却定律，并研究了声速。在数学上，牛顿与戈特弗里德·威廉·莱布尼茨共享了创立微积分的荣誉。他还证明了广义二项式定理，提出了逼近函数零点的“牛顿法”，并对幂级数的研究作出了贡献。在经济学上，牛顿提出了金本位制。"
        },
        {
            "start": "1769",
            "title": "瓦特改良蒸汽机",
            "description": ""
        },
        {
            "start": "1776",
            "title": "亚当·斯密《国富论》",
            "description": ""
        },
        {
            "start": "1892",
            "title": "伊万诺夫斯基发现病毒",
            "description": "伊万诺夫斯基通过细菌滤器提取出烟草花叶病毒。"
        },
        {
            "start": "1935",
            "title": "斯坦利研究病毒的结构",
            "description": "他获得了诺贝尔化学奖。温德尔·梅雷迪思·斯坦利（1904-1971），美国生物化学家、病毒学家。他首次用盐析法从植物细胞中分离出具有感染性的病毒蛋白结晶，暗示病毒能够进行细胞遗传反应。这为癌症研究开辟了重要途径，推动了病毒学的发展。因此，他于1946年分享了诺贝尔化学奖。1971年6月15日，他在西班牙逝世，享年67岁。"
        },
        {
            "start": "1946-02-14",
            "title": "通用计算机诞生",
            "description": "美国宾夕法尼亚大学。发明者是美国人约翰·莫奇利和普雷斯珀·埃克特。美国国防部用它进行弹道计算。"
        },
        {
            "start": "1953",
            "title": "发现DNA双螺旋结构",
            "description": "DNA的双螺旋结构由詹姆斯·沃森和弗朗西斯·克里克于1953年首次发表于《自然》杂志。"
        }
    ]
};

// 世界大战
var tl_world_war = {
    "dateTimeFormat": "iso8601",
    "events": [
        {
            "start": "1914-07-28",
            "end": "1918-11-11",
            "title": "第一次世界大战（1914-1918）",
            "description": "一战，第一次世界大战",
            "isDuration": true,
            "textColor": "black",
            "color": "#DF013A"
        },
        {
            "start": "1939-09-01",
            "end": "1945-09-02",
            "title": "第二次世界大战（1939-1945）",
            "description": "",
            "isDuration": true,
            "textColor": "black",
            "color": "#DF013A"
        },
        {
            "start": "1940-05-26",
            "title": "敦刻尔克大撤退",
            "description": ""
        },
        {
            "start": "1944-06-06",
            "title": "诺曼底登陆",
            "description": ""
        },
        {
            "start": "1945-08-06",
            "title": "广岛原子弹爆炸",
            "description": ""
        }
    ]
};

// 现代科学
var tl_science = {
    "dateTimeFormat": "iso8601",
    "events": [
        {
            "start": "1927",
            "title": "索尔维会议（第五届）",
            "description": ""
        }
    ]
};

// 此处列出的每个分组都会由 config.js 加载到年表上
var timelines = [
    tl_philosopher,
    tl_renaissance,
    tl_scientific_revolution,
    tl_world_war,
    tl_science
];
